; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - either_aircraft_person
either_aircraft_person city flevel - object)
(:predicates (at ?x - either_aircraft_person ?c - city)
             (in ?p - person ?a - aircraft)
       (fuel-level ?a - aircraft ?l - flevel)
       (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
     (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
     (next ?l2 ?l1)
     (next ?l3 ?l2)
    )
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
  )
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-2-1)
(:domain zeno-travel)
(:objects
  plane1 - aircraft
  plane2 - aircraft
  person1 - person
  city0 - city
  city1 - city
  fl0 - flevel
  fl1 - flevel
  fl2 - flevel
  fl3 - flevel
  fl4 - flevel
  fl5 - flevel
  fl6 - flevel
  )
(:init
  (at plane1 city0)
  (fuel-level plane1 fl1)
  (at plane2 city0)
  (fuel-level plane2 fl6)
  (at person1 city1)
  (next fl0 fl1)
  (next fl1 fl2)
  (next fl2 fl3)
  (next fl3 fl4)
  (next fl4 fl5)
  (next fl5 fl6)
)
(:goal (and
  (at person1 city0)
  ))

)

; plan
1. (fly plane2 city0 city1 fl6 fl5)
   deleted: (at plane2 city0) (fuel-level plane2 fl6)
   added: (at plane2 city1) (fuel-level plane2 fl5)
   goals met: 0 of 1
2. (board person1 plane2 city1)
   deleted: (at person1 city1)
   added: (in person1 plane2)
   goals met: 0 of 1
3. (zoom plane2 city1 city0 fl5 fl4 fl3)
   deleted: (at plane2 city1) (fuel-level plane2 fl5)
   added: (at plane2 city0) (fuel-level plane2 fl3)
   goals met: 0 of 1
4. (debark person1 plane2 city0)
   deleted: (in person1 plane2)
   added: (at person1 city0)
   goals met: 1 of 1
